## 📦 Terraform Plan Result
Terraform Plan Output:
```
data.google_project.project: Reading...
data.google_iam_policy.noauth: Reading...
google_pubsub_topic.vector_topic: Refreshing state... [id=projects/stalwart-camera-463819-k5/topics/vector-br-dev-event]
google_secret_manager_secret.vector_config: Refreshing state... [id=projects/stalwart-camera-463819-k5/secrets/br-dev-config]
data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_secret_manager_secret_version.vector_config: Refreshing state... [id=projects/361102057741/secrets/br-dev-config/versions/6]
google_cloud_run_service.vector: Refreshing state... [id=locations/europe-west3/namespaces/stalwart-camera-463819-k5/services/br-dev-collector]
google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/stalwart-camera-463819-k5/locations/europe-west3/services/br-dev-collector]
data.google_project.project: Read complete after 2s [id=projects/stalwart-camera-463819-k5]
google_project_iam_binding.vector_config_secret_access: Refreshing state... [id=stalwart-camera-463819-k5/roles/secretmanager.secretAccessor]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_service.vector will be updated in-place
  ~ resource "google_cloud_run_service" "vector" {
        id                         = "locations/europe-west3/namespaces/stalwart-camera-463819-k5/services/br-dev-collector"
        name                       = "br-dev-collector"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (5 unchanged attributes hidden)

              ~ containers {
                  ~ image       = "europe-west3-docker.pkg.dev/stalwart-camera-463819-k5/vector-br-repository/my-vector-local:74bfe28" -> "europe-west3-docker.pkg.dev/stalwart-camera-463819-k5/vector-br-repository/my-vector-local:9d0ec3d"
                    name        = null
                    # (3 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_secret_manager_secret_version.vector_config must be replaced
-/+ resource "google_secret_manager_secret_version" "vector_config" {
      ~ create_time            = "2025-07-14T19:05:17.302385Z" -> (known after apply)
      + destroy_time           = (known after apply)
      ~ id                     = "projects/361102057741/secrets/br-dev-config/versions/6" -> (known after apply)
      ~ name                   = "projects/361102057741/secrets/br-dev-config/versions/6" -> (known after apply)
      ~ secret_data            = (sensitive value) # forces replacement
      ~ version                = "6" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ vector_service_status = [
      ~ {
          ~ latest_created_revision_name = "br-dev-collector-00007-l9k" -> "br-dev-collector-00008-n45"
          ~ latest_ready_revision_name   = "br-dev-collector-00007-l9k" -> "br-dev-collector-00008-n45"
          ~ observed_generation          = 7 -> 8
          ~ traffic                      = [
              ~ {
                  ~ revision_name   = "br-dev-collector-00007-l9k" -> "br-dev-collector-00008-n45"
                    # (4 unchanged attributes hidden)
                },
            ]
            # (2 unchanged attributes hidden)
        },
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
✅ Review this plan and approve the deployment in Actions UI.